app/views/user/index.html.erb

SELECT  "creators".* FROM "creators" WHERE "creators"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---

		<% if @company.creators.length > 0 %>

SELECT "agencies".* FROM "agencies" INNER JOIN "agencies_creators" ON "agencies"."id" = "agencies_creators"."agency_id" WHERE "agencies_creators"."creator_id" = ?  [["creator_id", 1]]
---
			<h2>Agencies</h2>
			<% if @creator.agencies.length > 0 %>

SELECT "brands".* FROM "brands" INNER JOIN "brands_creators" ON "brands"."id" = "brands_creators"."brand_id" WHERE "brands_creators"."creator_id" = ?  [["creator_id", 1]]
---
			<h2>Brands</h2>
			<% if @creator.brands.length > 0 %>