app/controllers/app_controller.rb

INSERT INTO "agencies" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["description", "another test"], ["user_id", 6], ["created_at", 2017-01-18 22:15:55 UTC], ["updated_at", 2017-01-18 22:15:55 UTC]]
INSERT INTO "users" ("name", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hi"], ["kind", "Agency"], ["created_at", 2017-01-18 21:57:07 UTC], ["updated_at", 2017-01-18 21:57:07 UTC]]
INSERT INTO "brands" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "hello world"], ["description", "world"], ["user_id", 8], ["created_at", 2017-01-18 22:27:22 UTC], ["updated_at", 2017-01-18 22:27:22 UTC]]
---
	def create
		# Form parameters
		username = params[:user][:name]
		desc = params[:user][:description]
		type = params[:user][:kind]

		taken = check_user(username, type)
		if taken # Route back to homepage
			redirect_to '/', notice: "Company taken!"
		else
			# If username not taken, create a new user and
			# brand/agency depending on params. Then, link
			# the user to brand/agency

			# The `t` variable will be used to distinguish a
			# user between brand or agency
			@user = User.new
			if params[:user][:kind] == 'Agency'
				t = '(a) '
				@agency = Agency.create(:name => username, :description => desc)
				@user.agency = @agency
			else
				t = '(b) '
				@brand = Brand.create(:name => username, :description => desc)