app/controllers/user_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "agencies".* FROM "agencies" WHERE "agencies"."user_id" = ? LIMIT ?  [["user_id", 10], ["LIMIT", 1]]
SELECT  "brands".* FROM "brands" WHERE "brands"."user_id" = ? LIMIT ?  [["user_id", 11], ["LIMIT", 1]]
SELECT  "creators".* FROM "creators" WHERE "creators"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
	def index
		# Pass all the users in to populate dropdown
		# account switcher
		@users = User.all
		user = User.find(params[:id])
		@selected = user.id
		if user.kind == 'Agency'
			@company = Agency.find_by user_id: user.id
		elsif user.kind == 'Brand'
			@company = Brand.find_by user_id: user.id
		elsif user.kind == 'Creator'
			@creator = Creator.find_by user_id: user.id

SELECT  "creators".* FROM "creators" WHERE "creators"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "creators" ("name", "propic", "link", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def add

		company = current_company
		url = params[:user][:URL]
		input = check_url(url)

		# Reroute back to page if invalid URL
		if input[0] == nil && input[1] == nil && input[2] == nil
			redirect_to '/user/' + params[:id].to_s, notice: "Check if URL is a Youtube/Twitter user!"
		else
			creator = check_creator(input[0], input[1], url, input[2])

			# If creator is already associated with brand/agency,
			# give message that says `Creator already added!`
			if company.creators.include? creator
				redirect_to '/user/' + params[:id].to_s, notice: "Creator already added!"
			else
			# Otherwise, link creator and brand/agency
				company.creators << creator